Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus
An enumerated type listing all code checking status of the structural connection element.
Since:
2017
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus.CheckingFailed
Status checking failed.

Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus.OkChecked
Status OK checked.

Autodesk.Revit.DB.Structure.StructuralConnectionCodeCheckingStatus.NotCalculated
Status not calculated.